{
  "backend/main.mo": "Main Motoko actor for the Rich Pay backend, defining types and implementing employee management, bank account CRUD, chat messaging, user profiles, and invite-link-based registration with role-based access control.",
  "feature_evidence.json": "Feature evidence report linking the 'Add Bank Account' fix (REQ-18) to its relevant frontend files and component dependencies, with high confidence.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short summaries describing each file's purpose, covering auth, pages, hooks, and styling.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for shadcn semantic color tokens in both light and dark modes.",
  "frontend/index.html": "Minimal HTML shell for the Rich Pay React app, mounting the app into a root div and loading the Vite entry script.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree for the entire app, including protected admin and employee dashboard routes with session-based redirect guards.",
  "frontend/src/components/AdminLoginModal.tsx": "Modal component for admin login that authenticates credentials via `authenticateAdmin`, sets a session, and navigates to the admin accounts page.",
  "frontend/src/components/BankAccountEditModal.tsx": "Modal for editing an existing bank account by deleting and re-adding it via the backend actor, then invalidating the React Query cache.",
  "frontend/src/components/ChatThread.tsx": "A chat thread component that displays a conversation between two users, supports sending messages, and auto-scrolls to the latest message.",
  "frontend/src/components/EmployeeEditModal.tsx": "A modal form for editing an existing employee's full name and username, persisting changes via updateEmployee and invalidating the employees query cache.",
  "frontend/src/components/EmployeeLoginModal.tsx": "A modal login form for employees that authenticates credentials, sets a session, and navigates to the employee portal on success.",
  "frontend/src/components/GenerateInviteLinkButton.tsx": "A button that generates a one-time employee registration invite link and displays it in a modal with a copy-to-clipboard option.",
  "frontend/src/components/Logo.tsx": "A simple Logo component that renders the Rich Pay logo image at a configurable size (sm, md, lg).",
  "frontend/src/components/StatusBadge.tsx": "A small badge component that displays a color-coded status label for pending, approved, or rejected states.",
  "frontend/src/hooks/useActor.ts": "A hook that creates and caches an authenticated or anonymous ICP backend actor, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Computer authentication via AuthClient, exposing identity, login, clear, and status state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for bank accounts (localStorage-based CRUD), employees, and chat conversations, using the backend actor and local auth session.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a dark red OKLCH theme with custom CSS tokens for the RichPay UI, including scrollbar styling.",
  "frontend/src/lib/auth.ts": "localStorage-based authentication layer managing admin credentials, employee records, sessions, and bank accounts with CRUD helpers and default admin credentials.",
  "frontend/src/lib/utils.ts": "Utility functions for merging Tailwind class names and formatting dates/datetimes from bigint or numeric timestamps in Indian locale.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/admin/AllBankAccountsPage.tsx": "Admin page listing all employee-submitted bank accounts with search, status stats, and approve/reject actions.",
  "frontend/src/pages/admin/ChatsPage.tsx": "Admin chat page showing a sidebar of employees and a chat thread for private messaging with a selected employee.",
  "frontend/src/pages/admin/EmployeesPage.tsx": "Admin page displaying registered employees in a searchable table with edit actions and an invite link generator.",
  "frontend/src/pages/admin/MyAccountsPage.tsx": "Admin page for managing the admin's own bank accounts, including an add-account form and a list of existing accounts.",
  "frontend/src/pages/admin/SettingsPage.tsx": "Admin settings page for viewing and updating admin credentials (username and password) with current-password verification.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard layout with a responsive sidebar navigation (bank accounts, employees, chats, settings) and logout functionality using TanStack Router.",
  "frontend/src/pages/employee/AddBankAccountPage.tsx": "Form page that allows an employee to submit a new bank account (with IFSC validation) for admin approval, showing a success screen and redirecting to the accounts list on completion.",
  "frontend/src/pages/employee/ChatWithAdminPage.tsx": "Employee page that renders a full-height ChatThread component for a private conversation between the logged-in employee and the admin.",
  "frontend/src/pages/employee/CommissionInfoPage.tsx": "Informational page displaying the employee's 30% commission rate on approved Savings Accounts, including a step-by-step explanation and important notes.",
  "frontend/src/pages/employee/MyBankAccountsPage.tsx": "Displays a grid of the employee's submitted bank accounts with status badges and account details, with a button to navigate to the add-account page.",
  "frontend/src/pages/employee/MyProfilePage.tsx": "Profile page where an employee can update their full name and username, and change their password, with validation and success/error feedback.",
  "frontend/src/pages/EmployeeDashboard.tsx": "Employee dashboard layout with a responsive sidebar for navigating bank accounts, add account, commission, chat, and profile pages using TanStack Router.",
  "frontend/src/pages/EmployeeRegistrationPage.tsx": "Employee self-registration page that requires a URL token and a registration password, then saves the new employee to localStorage and optionally to the backend actor.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with branding and two login buttons (Admin and Employee) that open their respective modal components.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read, store, retrieve, and clear URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Rich Pay frontend, extending the default theme with shadcn/ui semantic color tokens and custom 'richpay' design tokens using oklch color space, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 5) describing the Rich Pay full-stack business banking app's architecture, existing features, known issues (employee bank account form broken), and implementation details including localStorage persistence, hardcoded admin credentials, and dark red theme."
}